# GetNumberOfBars Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..GetNumberOfBars Method
RebarUpdateCurvesData Class See Also
---
Returns the number of bars currently in the rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public int GetNumberOfBars()
```

Visual Basic
---
```text
Public Function GetNumberOfBars As Integer
```

Visual C++
---
```text
public:
int GetNumberOfBars()
```

# ### Return Value
Returns the number of bars currently in the rebar.
# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace